ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U5xx/stm32u5f7xx.h
/************* Bit definition for HSPI_ABR register  *************************/
#define HSPI_ABR_ALTERNATE_Pos           XSPI_ABR_ALTERNATE_Pos
#define HSPI_ABR_ALTERNATE_Msk           XSPI_ABR_ALTERNATE_Msk                           /*!< 0xFFFFFFFF */
#define HSPI_ABR_ALTERNATE               XSPI_ABR_ALTERNATE                               /*!< Alternate Bytes */

/************* Bit definition for HSPI_LPTR register  ************************/
#define HSPI_LPTR_TIMEOUT_Pos            XSPI_LPTR_TIMEOUT_Pos
#define HSPI_LPTR_TIMEOUT_Msk            XSPI_LPTR_TIMEOUT_Msk                            /*!< 0x0000FFFF */
#define HSPI_LPTR_TIMEOUT                XSPI_LPTR_TIMEOUT                                /*!< Timeout period */

/************ Bit definition for HSPI_WPCCR register  ************************/
#define HSPI_WPCCR_IMODE_Pos             XSPI_WPCCR_IMODE_Pos
#define HSPI_WPCCR_IMODE_Msk             XSPI_WPCCR_IMODE_Msk                             /*!< 0x00000007 */
#define HSPI_WPCCR_IMODE                 XSPI_WPCCR_IMODE                                 /*!< Instruction Mode */
#define HSPI_WPCCR_IMODE_0               XSPI_WPCCR_IMODE_0                               /*!< 0x00000001 */
#define HSPI_WPCCR_IMODE_1               XSPI_WPCCR_IMODE_1                               /*!< 0x00000002 */
#define HSPI_WPCCR_IMODE_2               XSPI_WPCCR_IMODE_2                               /*!< 0x00000004 */
#define HSPI_WPCCR_IDTR_Pos              XSPI_WPCCR_IDTR_Pos
#define HSPI_WPCCR_IDTR_Msk              XSPI_WPCCR_IDTR_Msk                              /*!< 0x00000008 */
#define HSPI_WPCCR_IDTR                  XSPI_WPCCR_IDTR                                  /*!< Instruction Double Transfer Rate */
#define HSPI_WPCCR_ISIZE_Pos             XSPI_WPCCR_ISIZE_Pos
#define HSPI_WPCCR_ISIZE_Msk             XSPI_WPCCR_ISIZE_Msk                             /*!< 0x00000030 */
#define HSPI_WPCCR_ISIZE                 XSPI_WPCCR_ISIZE                                 /*!< Instruction Size */
#define HSPI_WPCCR_ISIZE_0               XSPI_WPCCR_ISIZE_0                               /*!< 0x00000010 */
#define HSPI_WPCCR_ISIZE_1               XSPI_WPCCR_ISIZE_1                               /*!< 0x00000020 */
#define HSPI_WPCCR_ADMODE_Pos            XSPI_WPCCR_ADMODE_Pos
#define HSPI_WPCCR_ADMODE_Msk            XSPI_WPCCR_ADMODE_Msk                            /*!< 0x00000700 */
#define HSPI_WPCCR_ADMODE                XSPI_WPCCR_ADMODE                                /*!< Address Mode */
#define HSPI_WPCCR_ADMODE_0              XSPI_WPCCR_ADMODE_0                              /*!< 0x00000100 */
#define HSPI_WPCCR_ADMODE_1              XSPI_WPCCR_ADMODE_1                              /*!< 0x00000200 */
#define HSPI_WPCCR_ADMODE_2              XSPI_WPCCR_ADMODE_2                              /*!< 0x00000400 */
#define HSPI_WPCCR_ADDTR_Pos             XSPI_WPCCR_ADDTR_Pos
#define HSPI_WPCCR_ADDTR_Msk             XSPI_WPCCR_ADDTR_Msk                             /*!< 0x00000800 */
#define HSPI_WPCCR_ADDTR                 XSPI_WPCCR_ADDTR                                 /*!< Address Double Transfer Rate */
#define HSPI_WPCCR_ADSIZE_Pos            XSPI_WPCCR_ADSIZE_Pos
#define HSPI_WPCCR_ADSIZE_Msk            XSPI_WPCCR_ADSIZE_Msk                            /*!< 0x00003000 */
#define HSPI_WPCCR_ADSIZE                XSPI_WPCCR_ADSIZE                                /*!< Address Size */
#define HSPI_WPCCR_ADSIZE_0              XSPI_WPCCR_ADSIZE_0                              /*!< 0x00001000 */
#define HSPI_WPCCR_ADSIZE_1              XSPI_WPCCR_ADSIZE_1                              /*!< 0x00002000 */
#define HSPI_WPCCR_ABMODE_Pos            XSPI_WPCCR_ABMODE_Pos
#define HSPI_WPCCR_ABMODE_Msk            XSPI_WPCCR_ABMODE_Msk                            /*!< 0x00070000 */
#define HSPI_WPCCR_ABMODE                XSPI_WPCCR_ABMODE                                /*!< Alternate Bytes Mode */
#define HSPI_WPCCR_ABMODE_0              XSPI_WPCCR_ABMODE_0                              /*!< 0x00010000 */
#define HSPI_WPCCR_ABMODE_1              XSPI_WPCCR_ABMODE_1                              /*!< 0x00020000 */
#define HSPI_WPCCR_ABMODE_2              XSPI_WPCCR_ABMODE_2                              /*!< 0x00040000 */
#define HSPI_WPCCR_ABDTR_Pos             XSPI_WPCCR_ABDTR_Pos
#define HSPI_WPCCR_ABDTR_Msk             XSPI_WPCCR_ABDTR_Msk                             /*!< 0x00080000 */
#define HSPI_WPCCR_ABDTR                 XSPI_WPCCR_ABDTR                                 /*!< Alternate Bytes Double Transfer Rate */
#define HSPI_WPCCR_ABSIZE_Pos            XSPI_WPCCR_ABSIZE_Pos
#define HSPI_WPCCR_ABSIZE_Msk            XSPI_WPCCR_ABSIZE_Msk                            /*!< 0x00300000 */
#define HSPI_WPCCR_ABSIZE                XSPI_WPCCR_ABSIZE                                /*!< Alternate Bytes Size */
#define HSPI_WPCCR_ABSIZE_0              XSPI_WPCCR_ABSIZE_0                              /*!< 0x00100000 */
#define HSPI_WPCCR_ABSIZE_1              XSPI_WPCCR_ABSIZE_1                              /*!< 0x00200000 */
#define HSPI_WPCCR_DMODE_Pos             XSPI_WPCCR_DMODE_Pos
#define HSPI_WPCCR_DMODE_Msk             XSPI_WPCCR_DMODE_Msk                             /*!< 0x07000000 */
#define HSPI_WPCCR_DMODE                 XSPI_WPCCR_DMODE                                 /*!< Data Mode */
#define HSPI_WPCCR_DMODE_0               XSPI_WPCCR_DMODE_0                               /*!< 0x01000000 */
#define HSPI_WPCCR_DMODE_1               XSPI_WPCCR_DMODE_1                               /*!< 0x02000000 */
#define HSPI_WPCCR_DMODE_2               XSPI_WPCCR_DMODE_2                               /*!< 0x04000000 */
#define HSPI_WPCCR_DDTR_Pos              XSPI_WPCCR_DDTR_Pos
#define HSPI_WPCCR_DDTR_Msk              XSPI_WPCCR_DDTR_Msk                              /*!< 0x08000000 */
#define HSPI_WPCCR_DDTR                  XSPI_WPCCR_DDTR                                  /*!< Data Double Transfer Rate */
#define HSPI_WPCCR_DQSE_Pos              XSPI_WPCCR_DQSE_Pos
#define HSPI_WPCCR_DQSE_Msk              XSPI_WPCCR_DQSE_Msk                              /*!< 0x20000000 */
#define HSPI_WPCCR_DQSE                  XSPI_WPCCR_DQSE                                  /*!< DQS Enable */

/************ Bit definition for HSPI_WPTCR register  ************************/
#define HSPI_WPTCR_DCYC_Pos              XSPI_WPTCR_DCYC_Pos
#define HSPI_WPTCR_DCYC_Msk              XSPI_WPTCR_DCYC_Msk                              /*!< 0x0000001F */
#define HSPI_WPTCR_DCYC                  XSPI_WPTCR_DCYC                                  /*!< Number of Dummy Cycles */
#define HSPI_WPTCR_DHQC_Pos              XSPI_WPTCR_DHQC_Pos
#define HSPI_WPTCR_DHQC_Msk              XSPI_WPTCR_DHQC_Msk                              /*!< 0x10000000 */
#define HSPI_WPTCR_DHQC                  XSPI_WPTCR_DHQC                                  /*!< Delay Hold Quarter Cycle */
#define HSPI_WPTCR_SSHIFT_Pos            XSPI_WPTCR_SSHIFT_Pos
#define HSPI_WPTCR_SSHIFT_Msk            XSPI_WPTCR_SSHIFT_Msk                            /*!< 0x40000000 */
#define HSPI_WPTCR_SSHIFT                XSPI_WPTCR_SSHIFT                                /*!< Sample Shift */

